In [1]:
import warnings
warnings.filterwarnings('ignore')

In [2]:
a=[10, 50,  20, 60, 40]
print(a)

[10, 50, 20, 60, 40]

In [3]:
import pandas as pd
series_a=pd.Series(a)
print(series_a)

0    10
1    50
2    20
3    60
4    40
dtype: int64

In [4]:
my_index=['mercedes', 'fiat', 'vw', 'bmw', 'porsche']

In [5]:
series_a=pd.Series(a, index=my_index)

In [6]:
# series are lists with index!!! :-) 
print(series_a)

mercedes    10
fiat        50
vw          20
bmw         60
porsche     40
dtype: int64

In [7]:
print(series_a['bmw'])

60

In [8]:
series_a[3]

60

In [9]:
#read xlsx file from drive
data=pd.read_excel('students.xlsx')

In [10]:
#size of data (rows, columns)
print(data.shape)

(17, 6)

In [11]:
print(len(data))
print(data.shape[1])

17
6

In [12]:
print(data.head())

     student semester  language  science  maths  history
0   Alkistis        A      90.0     56.0   34.0     34.0
1      Eleni        A      10.0     40.0   32.0     67.0
2  Christina        A      90.0     23.0   12.0     32.0
3       Aris        A      20.0     50.0   90.0     45.0
4   Dimitris        A      30.0     56.0   45.0     65.0

In [13]:
print(data.head(3))

     student semester  language  science  maths  history
0   Alkistis        A      90.0     56.0   34.0     34.0
1      Eleni        A      10.0     40.0   32.0     67.0
2  Christina        A      90.0     23.0   12.0     32.0

In [14]:
print(data.tail())

   student semester  language  science  maths  history
12  Kostas        B      90.0     45.0   80.0     50.0
13   Manos        B      67.0     90.0   45.0     34.0
14  Spyros        A       NaN     50.0   50.0     50.0
15  Spyros        B      60.0      NaN    NaN     60.0
16    John        A      40.0     40.0   30.0      NaN

In [15]:
print(data.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 17 entries, 0 to 16
Data columns (total 6 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   student   17 non-null     object
 1   semester  17 non-null     object
 2   language  16 non-null     float64
 3   science   16 non-null     float64
 4   maths     16 non-null     float64
 5   history   16 non-null     float64
dtypes: float64(4), object(2)
memory usage: 944.0+ bytes
None

In [16]:
print(data.describe())

        language    science     maths    history
count  16.000000  16.000000  16.00000  16.000000
mean   53.375000  49.000000  47.31250  44.812500
std    32.737084  19.221516  25.63258  14.761295
min     5.000000  18.000000   9.00000  23.000000
25%    23.750000  40.000000  29.75000  33.500000
50%    55.000000  47.500000  45.00000  45.000000
75%    87.750000  52.250000  68.00000  60.000000
max    90.000000  90.000000  90.00000  67.000000

In [17]:
data.columns

Index(['student', 'semester', 'language', 'science', 'maths', 'history'], dtype='object')

In [18]:
#By Position - Select single row by row
data.iloc[0]

student     Alkistis
semester           A
language        90.0
science         56.0
maths           34.0
history         34.0
Name: 0, dtype: object

In [19]:
#By Position - Select single value by row and column
data.iloc[0][1]

'A'

In [20]:
#By Label - Select single value by row and column labels
data.loc[0]["language"]

90.0

In [21]:
data.sort_values(by='student',ascending=False)

      student semester  language  science  maths  history
15     Spyros        B      60.0      NaN    NaN     60.0
14     Spyros        A       NaN     50.0   50.0     50.0
13      Manos        B      67.0     90.0   45.0     34.0
6       Manos        A      50.0     90.0   45.0     23.0
5      Kostas        A      90.0     45.0   80.0     34.0
12     Kostas        B      90.0     45.0   80.0     50.0
16       John        A      40.0     40.0   30.0      NaN
1       Eleni        A      10.0     40.0   32.0     67.0
8       Eleni        B       5.0     34.0   27.0     62.0
11   Dimitris        B      25.0     51.0   64.0     60.0
4    Dimitris        A      30.0     56.0   45.0     65.0
9   Christina        B      85.0     18.0    9.0     27.0
2   Christina        A      90.0     23.0   12.0     32.0
10       Aris        B      15.0     45.0   85.0     45.0
3        Aris        A      20.0     50.0   90.0     45.0
7    Alkistis        B      87.0     51.0   29.0     29.0
0    Alkistis        A      90.0     56.0   34.0     34.0

In [22]:
#Use filter to adjust DataFrame
data[data['language']>50]

      student semester  language  science  maths  history
0    Alkistis        A      90.0     56.0   34.0     34.0
2   Christina        A      90.0     23.0   12.0     32.0
5      Kostas        A      90.0     45.0   80.0     34.0
7    Alkistis        B      87.0     51.0   29.0     29.0
9   Christina        B      85.0     18.0    9.0     27.0
12     Kostas        B      90.0     45.0   80.0     50.0
13      Manos        B      67.0     90.0   45.0     34.0
15     Spyros        B      60.0      NaN    NaN     60.0

In [23]:
data.min()

student     Alkistis
semester           A
language         5.0
science         18.0
maths            9.0
history         23.0
dtype: object

In [24]:
#Maximum values
data.max()

student     Spyros
semester         B
language      90.0
science       90.0
maths         90.0
history       67.0
dtype: object

In [25]:
#Sum of values
data.sum()

student     AlkistisEleniChristinaArisDimitrisKostasManosA...
semester                                    AAAAAAABBBBBBBABA
language                                                854.0
science                                                 784.0
maths                                                   757.0
history                                                 717.0
dtype: object

In [26]:
data['language'].sum()

854.0

In [27]:
#Used to generate a random sample
data.sample(2)

    student semester  language  science  maths  history
5    Kostas        A      90.0     45.0   80.0     34.0
4  Dimitris        A      30.0     56.0   45.0     65.0

In [28]:
#returns true/false. True where a null value exists and false where it does not
data.isnull()

    student  semester  language  science  maths  history
0     False     False     False    False  False    False
1     False     False     False    False  False    False
2     False     False     False    False  False    False
3     False     False     False    False  False    False
4     False     False     False    False  False    False
5     False     False     False    False  False    False
6     False     False     False    False  False    False
7     False     False     False    False  False    False
8     False     False     False    False  False    False
9     False     False     False    False  False    False
10    False     False     False    False  False    False
11    False     False     False    False  False    False
12    False     False     False    False  False    False
13    False     False     False    False  False    False
14    False     False      True    False  False    False
15    False     False     False     True   True    False
16    False     False     False    False  False     True

In [29]:
#Return the number of missing values in each column
data.isnull().sum()

student     0
semester    0
language    1
science     1
maths       1
history     1
dtype: int64

In [30]:
#Return number of unique elements in the object. 
data.nunique()

student      9
semester     2
language    13
science      9
maths       13
history     11
dtype: int64

In [31]:
#Returns the first n rows ordered by columns in descending order
data.nlargest(3,"maths")

   student semester  language  science  maths  history
3     Aris        A      20.0     50.0   90.0     45.0
10    Aris        B      15.0     45.0   85.0     45.0
5   Kostas        A      90.0     45.0   80.0     34.0

In [32]:
# FILTER AND
data[(data['semester']==1) & (data['science']>50)]

Empty DataFrame
Columns: [student, semester, language, science, maths, history]
Index: []

In [33]:
#OR
data[(data['semester']==1) | (data['science']>50)]

     student semester  language  science  maths  history
0   Alkistis        A      90.0     56.0   34.0     34.0
4   Dimitris        A      30.0     56.0   45.0     65.0
6      Manos        A      50.0     90.0   45.0     23.0
7   Alkistis        B      87.0     51.0   29.0     29.0
11  Dimitris        B      25.0     51.0   64.0     60.0
13     Manos        B      67.0     90.0   45.0     34.0

In [34]:
#Filter where Math scores are above 50 (only student)
data['student'][data.maths>50]

3         Aris
5       Kostas
10        Aris
11    Dimitris
12      Kostas
Name: student, dtype: object

In [35]:
#Filter where Math scores are above 50 (only student)
data['student'][data['maths']>50]

3         Aris
5       Kostas
10        Aris
11    Dimitris
12      Kostas
Name: student, dtype: object

In [36]:
my_data=data.copy()

In [37]:
print(data[:2])

    student semester  language  science  maths  history
0  Alkistis        A      90.0     56.0   34.0     34.0
1     Eleni        A      10.0     40.0   32.0     67.0

In [38]:
my_data_2=my_data.set_index('student')

In [39]:
print(my_data)
print(my_data_2)

      student semester  language  science  maths  history
0    Alkistis        A      90.0     56.0   34.0     34.0
1       Eleni        A      10.0     40.0   32.0     67.0
2   Christina        A      90.0     23.0   12.0     32.0
3        Aris        A      20.0     50.0   90.0     45.0
4    Dimitris        A      30.0     56.0   45.0     65.0
5      Kostas        A      90.0     45.0   80.0     34.0
6       Manos        A      50.0     90.0   45.0     23.0
7    Alkistis        B      87.0     51.0   29.0     29.0
8       Eleni        B       5.0     34.0   27.0     62.0
9   Christina        B      85.0     18.0    9.0     27.0
10       Aris        B      15.0     45.0   85.0     45.0
11   Dimitris        B      25.0     51.0   64.0     60.0
12     Kostas        B      90.0     45.0   80.0     50.0
13      Manos        B      67.0     90.0   45.0     34.0
14     Spyros        A       NaN     50.0   50.0     50.0
15     Spyros        B      60.0      NaN    NaN     60.0
16       John        A      40.0     40.0   30.0      NaN
          semester  language  science  maths  history
student
Alkistis         A      90.0     56.0   34.0     34.0
Eleni            A      10.0     40.0   32.0     67.0
Christina        A      90.0     23.0   12.0     32.0
Aris             A      20.0     50.0   90.0     45.0
Dimitris         A      30.0     56.0   45.0     65.0
Kostas           A      90.0     45.0   80.0     34.0
Manos            A      50.0     90.0   45.0     23.0
Alkistis         B      87.0     51.0   29.0     29.0
Eleni            B       5.0     34.0   27.0     62.0
Christina        B      85.0     18.0    9.0     27.0
Aris             B      15.0     45.0   85.0     45.0
Dimitris         B      25.0     51.0   64.0     60.0
Kostas           B      90.0     45.0   80.0     50.0
Manos            B      67.0     90.0   45.0     34.0
Spyros           A       NaN     50.0   50.0     50.0
Spyros           B      60.0      NaN    NaN     60.0
John             A      40.0     40.0   30.0      NaN

In [40]:
print(my_data)
print('\n'+"="*50+'\n')
print(my_data.iloc[:2])

      student semester  language  science  maths  history
0    Alkistis        A      90.0     56.0   34.0     34.0
1       Eleni        A      10.0     40.0   32.0     67.0
2   Christina        A      90.0     23.0   12.0     32.0
3        Aris        A      20.0     50.0   90.0     45.0
4    Dimitris        A      30.0     56.0   45.0     65.0
5      Kostas        A      90.0     45.0   80.0     34.0
6       Manos        A      50.0     90.0   45.0     23.0
7    Alkistis        B      87.0     51.0   29.0     29.0
8       Eleni        B       5.0     34.0   27.0     62.0
9   Christina        B      85.0     18.0    9.0     27.0
10       Aris        B      15.0     45.0   85.0     45.0
11   Dimitris        B      25.0     51.0   64.0     60.0
12     Kostas        B      90.0     45.0   80.0     50.0
13      Manos        B      67.0     90.0   45.0     34.0
14     Spyros        A       NaN     50.0   50.0     50.0
15     Spyros        B      60.0      NaN    NaN     60.0
16       John        A      40.0     40.0   30.0      NaN

==================================================

    student semester  language  science  maths  history
0  Alkistis        A      90.0     56.0   34.0     34.0
1     Eleni        A      10.0     40.0   32.0     67.0

In [41]:
#print christina when index is numveric
print(my_data.iloc[2])

student     Christina
semester            A
language         90.0
science          23.0
maths            12.0
history          32.0
Name: 2, dtype: object

In [42]:
print(my_data.iloc[2][1])

A

In [43]:
#print christina when index=student
print(my_data_2.loc['Christina'])

          semester  language  science  maths  history
student
Christina        A      90.0     23.0   12.0     32.0
Christina        B      85.0     18.0    9.0     27.0

In [44]:
#drop an index
my_data_3=data.drop(6)


print(my_data_3)
print('\n'+"="*50+'\n')
print(data)

      student semester  language  science  maths  history
0    Alkistis        A      90.0     56.0   34.0     34.0
1       Eleni        A      10.0     40.0   32.0     67.0
2   Christina        A      90.0     23.0   12.0     32.0
3        Aris        A      20.0     50.0   90.0     45.0
4    Dimitris        A      30.0     56.0   45.0     65.0
5      Kostas        A      90.0     45.0   80.0     34.0
7    Alkistis        B      87.0     51.0   29.0     29.0
8       Eleni        B       5.0     34.0   27.0     62.0
9   Christina        B      85.0     18.0    9.0     27.0
10       Aris        B      15.0     45.0   85.0     45.0
11   Dimitris        B      25.0     51.0   64.0     60.0
12     Kostas        B      90.0     45.0   80.0     50.0
13      Manos        B      67.0     90.0   45.0     34.0
14     Spyros        A       NaN     50.0   50.0     50.0
15     Spyros        B      60.0      NaN    NaN     60.0
16       John        A      40.0     40.0   30.0      NaN

==================================================

      student semester  language  science  maths  history
0    Alkistis        A      90.0     56.0   34.0     34.0
1       Eleni        A      10.0     40.0   32.0     67.0
2   Christina        A      90.0     23.0   12.0     32.0
3        Aris        A      20.0     50.0   90.0     45.0
4    Dimitris        A      30.0     56.0   45.0     65.0
5      Kostas        A      90.0     45.0   80.0     34.0
6       Manos        A      50.0     90.0   45.0     23.0
7    Alkistis        B      87.0     51.0   29.0     29.0
8       Eleni        B       5.0     34.0   27.0     62.0
9   Christina        B      85.0     18.0    9.0     27.0
10       Aris        B      15.0     45.0   85.0     45.0
11   Dimitris        B      25.0     51.0   64.0     60.0
12     Kostas        B      90.0     45.0   80.0     50.0
13      Manos        B      67.0     90.0   45.0     34.0
14     Spyros        A       NaN     50.0   50.0     50.0
15     Spyros        B      60.0      NaN    NaN     60.0
16       John        A      40.0     40.0   30.0      NaN

In [45]:
#group by Student name and count
data.groupby('student').count()

           semester  language  science  maths  history
student
Alkistis          2         2        2      2        2
Aris              2         2        2      2        2
Christina         2         2        2      2        2
Dimitris          2         2        2      2        2
Eleni             2         2        2      2        2
John              1         1        1      1        0
Kostas            2         2        2      2        2
Manos             2         2        2      2        2
Spyros            2         1        1      1        2

In [46]:
#group by Student name and count
data.groupby('student').sum()

           language  science  maths  history
student
Alkistis      177.0    107.0   63.0     63.0
Aris           35.0     95.0  175.0     90.0
Christina     175.0     41.0   21.0     59.0
Dimitris       55.0    107.0  109.0    125.0
Eleni          15.0     74.0   59.0    129.0
John           40.0     40.0   30.0      0.0
Kostas        180.0     90.0  160.0     84.0
Manos         117.0    180.0   90.0     57.0
Spyros         60.0     50.0   50.0    110.0

In [47]:
# Group by student with mean - what have done differently here?
data.groupby('student').mean()

           language  science  maths  history
student
Alkistis       88.5     53.5   31.5     31.5
Aris           17.5     47.5   87.5     45.0
Christina      87.5     20.5   10.5     29.5
Dimitris       27.5     53.5   54.5     62.5
Eleni           7.5     37.0   29.5     64.5
John           40.0     40.0   30.0      NaN
Kostas         90.0     45.0   80.0     42.0
Manos          58.5     90.0   45.0     28.5
Spyros         60.0     50.0   50.0     55.0

In [48]:
#GroupBy student and semester with count
data.groupby('student')['semester'].count()

student
Alkistis     2
Aris         2
Christina    2
Dimitris     2
Eleni        2
John         1
Kostas       2
Manos        2
Spyros       2
Name: semester, dtype: int64

In [49]:
#GroupBy student and semester with count
data.groupby('student')['semester'].max()

student
Alkistis     B
Aris         B
Christina    B
Dimitris     B
Eleni        B
John         A
Kostas       B
Manos        B
Spyros       B
Name: semester, dtype: object

In [50]:
#drop many indexes 

my_data_3=data.drop([2,4,8])
print(my_data_3)

      student semester  language  science  maths  history
0    Alkistis        A      90.0     56.0   34.0     34.0
1       Eleni        A      10.0     40.0   32.0     67.0
3        Aris        A      20.0     50.0   90.0     45.0
5      Kostas        A      90.0     45.0   80.0     34.0
6       Manos        A      50.0     90.0   45.0     23.0
7    Alkistis        B      87.0     51.0   29.0     29.0
9   Christina        B      85.0     18.0    9.0     27.0
10       Aris        B      15.0     45.0   85.0     45.0
11   Dimitris        B      25.0     51.0   64.0     60.0
12     Kostas        B      90.0     45.0   80.0     50.0
13      Manos        B      67.0     90.0   45.0     34.0
14     Spyros        A       NaN     50.0   50.0     50.0
15     Spyros        B      60.0      NaN    NaN     60.0
16       John        A      40.0     40.0   30.0      NaN

In [51]:
data

      student semester  language  science  maths  history
0    Alkistis        A      90.0     56.0   34.0     34.0
1       Eleni        A      10.0     40.0   32.0     67.0
2   Christina        A      90.0     23.0   12.0     32.0
3        Aris        A      20.0     50.0   90.0     45.0
4    Dimitris        A      30.0     56.0   45.0     65.0
5      Kostas        A      90.0     45.0   80.0     34.0
6       Manos        A      50.0     90.0   45.0     23.0
7    Alkistis        B      87.0     51.0   29.0     29.0
8       Eleni        B       5.0     34.0   27.0     62.0
9   Christina        B      85.0     18.0    9.0     27.0
10       Aris        B      15.0     45.0   85.0     45.0
11   Dimitris        B      25.0     51.0   64.0     60.0
12     Kostas        B      90.0     45.0   80.0     50.0
13      Manos        B      67.0     90.0   45.0     34.0
14     Spyros        A       NaN     50.0   50.0     50.0
15     Spyros        B      60.0      NaN    NaN     60.0
16       John        A      40.0     40.0   30.0      NaN

In [52]:
my_data_3=data.dropna()
print(my_data_3)

      student semester  language  science  maths  history
0    Alkistis        A      90.0     56.0   34.0     34.0
1       Eleni        A      10.0     40.0   32.0     67.0
2   Christina        A      90.0     23.0   12.0     32.0
3        Aris        A      20.0     50.0   90.0     45.0
4    Dimitris        A      30.0     56.0   45.0     65.0
5      Kostas        A      90.0     45.0   80.0     34.0
6       Manos        A      50.0     90.0   45.0     23.0
7    Alkistis        B      87.0     51.0   29.0     29.0
8       Eleni        B       5.0     34.0   27.0     62.0
9   Christina        B      85.0     18.0    9.0     27.0
10       Aris        B      15.0     45.0   85.0     45.0
11   Dimitris        B      25.0     51.0   64.0     60.0
12     Kostas        B      90.0     45.0   80.0     50.0
13      Manos        B      67.0     90.0   45.0     34.0

In [53]:
my_data_3=data.dropna(subset=['science'])
print(my_data_3)
print('\n'+"="*50+'\n')
print(data)

      student semester  language  science  maths  history
0    Alkistis        A      90.0     56.0   34.0     34.0
1       Eleni        A      10.0     40.0   32.0     67.0
2   Christina        A      90.0     23.0   12.0     32.0
3        Aris        A      20.0     50.0   90.0     45.0
4    Dimitris        A      30.0     56.0   45.0     65.0
5      Kostas        A      90.0     45.0   80.0     34.0
6       Manos        A      50.0     90.0   45.0     23.0
7    Alkistis        B      87.0     51.0   29.0     29.0
8       Eleni        B       5.0     34.0   27.0     62.0
9   Christina        B      85.0     18.0    9.0     27.0
10       Aris        B      15.0     45.0   85.0     45.0
11   Dimitris        B      25.0     51.0   64.0     60.0
12     Kostas        B      90.0     45.0   80.0     50.0
13      Manos        B      67.0     90.0   45.0     34.0
14     Spyros        A       NaN     50.0   50.0     50.0
16       John        A      40.0     40.0   30.0      NaN

==================================================

      student semester  language  science  maths  history
0    Alkistis        A      90.0     56.0   34.0     34.0
1       Eleni        A      10.0     40.0   32.0     67.0
2   Christina        A      90.0     23.0   12.0     32.0
3        Aris        A      20.0     50.0   90.0     45.0
4    Dimitris        A      30.0     56.0   45.0     65.0
5      Kostas        A      90.0     45.0   80.0     34.0
6       Manos        A      50.0     90.0   45.0     23.0
7    Alkistis        B      87.0     51.0   29.0     29.0
8       Eleni        B       5.0     34.0   27.0     62.0
9   Christina        B      85.0     18.0    9.0     27.0
10       Aris        B      15.0     45.0   85.0     45.0
11   Dimitris        B      25.0     51.0   64.0     60.0
12     Kostas        B      90.0     45.0   80.0     50.0
13      Manos        B      67.0     90.0   45.0     34.0
14     Spyros        A       NaN     50.0   50.0     50.0
15     Spyros        B      60.0      NaN    NaN     60.0
16       John        A      40.0     40.0   30.0      NaN

In [54]:
my_data_3=data.dropna(axis='columns')
print(my_data_3)
print('\n'+"="*50+'\n')
print(data)

      student semester
0    Alkistis        A
1       Eleni        A
2   Christina        A
3        Aris        A
4    Dimitris        A
5      Kostas        A
6       Manos        A
7    Alkistis        B
8       Eleni        B
9   Christina        B
10       Aris        B
11   Dimitris        B
12     Kostas        B
13      Manos        B
14     Spyros        A
15     Spyros        B
16       John        A

==================================================

      student semester  language  science  maths  history
0    Alkistis        A      90.0     56.0   34.0     34.0
1       Eleni        A      10.0     40.0   32.0     67.0
2   Christina        A      90.0     23.0   12.0     32.0
3        Aris        A      20.0     50.0   90.0     45.0
4    Dimitris        A      30.0     56.0   45.0     65.0
5      Kostas        A      90.0     45.0   80.0     34.0
6       Manos        A      50.0     90.0   45.0     23.0
7    Alkistis        B      87.0     51.0   29.0     29.0
8       Eleni        B       5.0     34.0   27.0     62.0
9   Christina        B      85.0     18.0    9.0     27.0
10       Aris        B      15.0     45.0   85.0     45.0
11   Dimitris        B      25.0     51.0   64.0     60.0
12     Kostas        B      90.0     45.0   80.0     50.0
13      Manos        B      67.0     90.0   45.0     34.0
14     Spyros        A       NaN     50.0   50.0     50.0
15     Spyros        B      60.0      NaN    NaN     60.0
16       John        A      40.0     40.0   30.0      NaN

In [55]:
data.dropna(inplace=True)

In [56]:
#sort by column

my_data_3=data.sort_values('history',ascending=False)
print(my_data_3)
print('\n'+"="*50+'\n')
print(data)

      student semester  language  science  maths  history
1       Eleni        A      10.0     40.0   32.0     67.0
4    Dimitris        A      30.0     56.0   45.0     65.0
8       Eleni        B       5.0     34.0   27.0     62.0
11   Dimitris        B      25.0     51.0   64.0     60.0
12     Kostas        B      90.0     45.0   80.0     50.0
3        Aris        A      20.0     50.0   90.0     45.0
10       Aris        B      15.0     45.0   85.0     45.0
0    Alkistis        A      90.0     56.0   34.0     34.0
5      Kostas        A      90.0     45.0   80.0     34.0
13      Manos        B      67.0     90.0   45.0     34.0
2   Christina        A      90.0     23.0   12.0     32.0
7    Alkistis        B      87.0     51.0   29.0     29.0
9   Christina        B      85.0     18.0    9.0     27.0
6       Manos        A      50.0     90.0   45.0     23.0

==================================================

      student semester  language  science  maths  history
0    Alkistis        A      90.0     56.0   34.0     34.0
1       Eleni        A      10.0     40.0   32.0     67.0
2   Christina        A      90.0     23.0   12.0     32.0
3        Aris        A      20.0     50.0   90.0     45.0
4    Dimitris        A      30.0     56.0   45.0     65.0
5      Kostas        A      90.0     45.0   80.0     34.0
6       Manos        A      50.0     90.0   45.0     23.0
7    Alkistis        B      87.0     51.0   29.0     29.0
8       Eleni        B       5.0     34.0   27.0     62.0
9   Christina        B      85.0     18.0    9.0     27.0
10       Aris        B      15.0     45.0   85.0     45.0
11   Dimitris        B      25.0     51.0   64.0     60.0
12     Kostas        B      90.0     45.0   80.0     50.0
13      Manos        B      67.0     90.0   45.0     34.0

In [57]:
#max of each column
data.max()

student     Manos
semester        B
language     90.0
science      90.0
maths        90.0
history      67.0
dtype: object

In [58]:
data

      student semester  language  science  maths  history
0    Alkistis        A      90.0     56.0   34.0     34.0
1       Eleni        A      10.0     40.0   32.0     67.0
2   Christina        A      90.0     23.0   12.0     32.0
3        Aris        A      20.0     50.0   90.0     45.0
4    Dimitris        A      30.0     56.0   45.0     65.0
5      Kostas        A      90.0     45.0   80.0     34.0
6       Manos        A      50.0     90.0   45.0     23.0
7    Alkistis        B      87.0     51.0   29.0     29.0
8       Eleni        B       5.0     34.0   27.0     62.0
9   Christina        B      85.0     18.0    9.0     27.0
10       Aris        B      15.0     45.0   85.0     45.0
11   Dimitris        B      25.0     51.0   64.0     60.0
12     Kostas        B      90.0     45.0   80.0     50.0
13      Manos        B      67.0     90.0   45.0     34.0

In [59]:
#Calculated Columns
data['theoritical_avg']=(data['language']+data['history'])/2

In [60]:
data

      student semester  language  science  maths  history  theoritical_avg
0    Alkistis        A      90.0     56.0   34.0     34.0             62.0
1       Eleni        A      10.0     40.0   32.0     67.0             38.5
2   Christina        A      90.0     23.0   12.0     32.0             61.0
3        Aris        A      20.0     50.0   90.0     45.0             32.5
4    Dimitris        A      30.0     56.0   45.0     65.0             47.5
5      Kostas        A      90.0     45.0   80.0     34.0             62.0
6       Manos        A      50.0     90.0   45.0     23.0             36.5
7    Alkistis        B      87.0     51.0   29.0     29.0             58.0
8       Eleni        B       5.0     34.0   27.0     62.0             33.5
9   Christina        B      85.0     18.0    9.0     27.0             56.0
10       Aris        B      15.0     45.0   85.0     45.0             30.0
11   Dimitris        B      25.0     51.0   64.0     60.0             42.5
12     Kostas        B      90.0     45.0   80.0     50.0             70.0
13      Manos        B      67.0     90.0   45.0     34.0             50.5

In [61]:
data['exact_sciences_avg']=(data['science']+data['maths'])/2

In [62]:
data

,student,semester,language,science,maths,history,theoritical_avg,exact_sciences_avg
0,Alkistis,A,90.0,56.0,34.0,34.0,62.0,45.0
1,Eleni,A,10.0,40.0,32.0,67.0,38.5,36.0
2,Christina,A,90.0,23.0,12.0,32.0,61.0,17.5
3,Aris,A,20.0,50.0,90.0,45.0,32.5,70.0
4,Dimitris,A,30.0,56.0,45.0,65.0,47.5,50.5
5,Kostas,A,90.0,45.0,80.0,34.0,62.0,62.5
6,Manos,A,50.0,90.0,45.0,23.0,36.5,67.5
7,Alkistis,B,87.0,51.0,29.0,29.0,58.0,40.0
8,Eleni,B,5.0,34.0,27.0,62.0,33.5,30.5
9,Christina,B,85.0,18.0,9.0,27.0,56.0,13.5
10,Aris,B,15.0,45.0,85.0,45.0,30.0,65.0
11,Dimitris,B,25.0,51.0,64.0,60.0,42.5,57.5
12,Kostas,B,90.0,45.0,80.0,50.0,70.0,62.5
13,Manos,B,67.0,90.0,45.0,34.0,50.5,67.5

In [63]:
# Filter or slice with condition
data=data.loc[data['semester']=="A" ]

In [64]:
data

,student,semester,language,science,maths,history,theoritical_avg,exact_sciences_avg
0,Alkistis,A,90.0,56.0,34.0,34.0,62.0,45.0
1,Eleni,A,10.0,40.0,32.0,67.0,38.5,36.0
2,Christina,A,90.0,23.0,12.0,32.0,61.0,17.5
3,Aris,A,20.0,50.0,90.0,45.0,32.5,70.0
4,Dimitris,A,30.0,56.0,45.0,65.0,47.5,50.5
5,Kostas,A,90.0,45.0,80.0,34.0,62.0,62.5
6,Manos,A,50.0,90.0,45.0,23.0,36.5,67.5

In [65]:
data.loc[data['theoritical_avg']>=50,'theoritical_passORfail']='pass'

In [66]:
data

,student,semester,language,science,maths,history,theoritical_avg,exact_sciences_avg,theoritical_passORfail
0,Alkistis,A,90.0,56.0,34.0,34.0,62.0,45.0,pass
1,Eleni,A,10.0,40.0,32.0,67.0,38.5,36.0,NaN
2,Christina,A,90.0,23.0,12.0,32.0,61.0,17.5,pass
3,Aris,A,20.0,50.0,90.0,45.0,32.5,70.0,NaN
4,Dimitris,A,30.0,56.0,45.0,65.0,47.5,50.5,NaN
5,Kostas,A,90.0,45.0,80.0,34.0,62.0,62.5,pass
6,Manos,A,50.0,90.0,45.0,23.0,36.5,67.5,NaN

In [67]:
data.loc[data['theoritical_avg']<50,'theoritical_passORfail']='fail'
data

,student,semester,language,science,maths,history,theoritical_avg,exact_sciences_avg,theoritical_passORfail
0,Alkistis,A,90.0,56.0,34.0,34.0,62.0,45.0,pass
1,Eleni,A,10.0,40.0,32.0,67.0,38.5,36.0,fail
2,Christina,A,90.0,23.0,12.0,32.0,61.0,17.5,pass
3,Aris,A,20.0,50.0,90.0,45.0,32.5,70.0,fail
4,Dimitris,A,30.0,56.0,45.0,65.0,47.5,50.5,fail
5,Kostas,A,90.0,45.0,80.0,34.0,62.0,62.5,pass
6,Manos,A,50.0,90.0,45.0,23.0,36.5,67.5,fail

In [68]:
def pass_or_fail(num):
    if num>=50:
        result = 'pass'
    else:
        result ='fail'
    return result

In [69]:
data['exact_sciences_passORfail']=list(map(pass_or_fail, data['exact_sciences_avg']))

In [70]:
data

,student,semester,language,science,maths,history,theoritical_avg,exact_sciences_avg,theoritical_passORfail,exact_sciences_passORfail
0,Alkistis,A,90.0,56.0,34.0,34.0,62.0,45.0,pass,fail
1,Eleni,A,10.0,40.0,32.0,67.0,38.5,36.0,fail,fail
2,Christina,A,90.0,23.0,12.0,32.0,61.0,17.5,pass,fail
3,Aris,A,20.0,50.0,90.0,45.0,32.5,70.0,fail,pass
4,Dimitris,A,30.0,56.0,45.0,65.0,47.5,50.5,fail,pass
5,Kostas,A,90.0,45.0,80.0,34.0,62.0,62.5,pass,pass
6,Manos,A,50.0,90.0,45.0,23.0,36.5,67.5,fail,pass

In [71]:
# replace with native replace function
data['semester']=data['semester'].replace("A",'first')

In [72]:
data

,student,semester,language,science,maths,history,theoritical_avg,exact_sciences_avg,theoritical_passORfail,exact_sciences_passORfail
0,Alkistis,first,90.0,56.0,34.0,34.0,62.0,45.0,pass,fail
1,Eleni,first,10.0,40.0,32.0,67.0,38.5,36.0,fail,fail
2,Christina,first,90.0,23.0,12.0,32.0,61.0,17.5,pass,fail
3,Aris,first,20.0,50.0,90.0,45.0,32.5,70.0,fail,pass
4,Dimitris,first,30.0,56.0,45.0,65.0,47.5,50.5,fail,pass
5,Kostas,first,90.0,45.0,80.0,34.0,62.0,62.5,pass,pass
6,Manos,first,50.0,90.0,45.0,23.0,36.5,67.5,fail,pass

In [73]:
data

,student,semester,language,science,maths,history,theoritical_avg,exact_sciences_avg,theoritical_passORfail,exact_sciences_passORfail
0,Alkistis,first,90.0,56.0,34.0,34.0,62.0,45.0,pass,fail
1,Eleni,first,10.0,40.0,32.0,67.0,38.5,36.0,fail,fail
2,Christina,first,90.0,23.0,12.0,32.0,61.0,17.5,pass,fail
3,Aris,first,20.0,50.0,90.0,45.0,32.5,70.0,fail,pass
4,Dimitris,first,30.0,56.0,45.0,65.0,47.5,50.5,fail,pass
5,Kostas,first,90.0,45.0,80.0,34.0,62.0,62.5,pass,pass
6,Manos,first,50.0,90.0,45.0,23.0,36.5,67.5,fail,pass

In [74]:
#check condition
data['theoritical_passORfail']=='fail'

0    False
1     True
2    False
3     True
4     True
5    False
6     True
Name: theoritical_passORfail, dtype: bool

In [75]:
#indexes where condition is valid
data[data['theoritical_passORfail']=='fail'].index

Int64Index([1, 3, 4, 6], dtype='int64')

In [76]:
#use those indexes to drop rows
data.drop(data[data['theoritical_passORfail']=='fail'].index, inplace=True)

In [77]:
data

,student,semester,language,science,maths,history,theoritical_avg,exact_sciences_avg,theoritical_passORfail,exact_sciences_passORfail
0,Alkistis,first,90.0,56.0,34.0,34.0,62.0,45.0,pass,fail
2,Christina,first,90.0,23.0,12.0,32.0,61.0,17.5,pass,fail
5,Kostas,first,90.0,45.0,80.0,34.0,62.0,62.5,pass,pass

In [78]:
#create the lists of components
student = ['Nick', 'John', 'Jim', 'Sam']
Language = [70,90,100,50]
Science = [60,80,75,96]
History = [85,87,55,67]
Maths = [80,87,88,74]
StudentCode = ['2018-9875-13','2017-9356-23','2019-8988-43','2016-0099-13']

In [79]:
#create the dictionary from the lists
d = { 'Language':Language,'Science':Science,'History':History,'Maths':Maths,'StudentCode':StudentCode }

In [80]:
#transform to a dataframe
df= pd.DataFrame(data=d, index=student)
df.head()

      Language  Science  History  Maths   StudentCode
Nick        70       60       85     80  2018-9875-13
John        90       80       87     87  2017-9356-23
Jim        100       75       55     88  2019-8988-43
Sam         50       96       67     74  2016-0099-13

In [81]:
string='This is a line'
lista=string.split()
print(lista)
print(lista[0])

['This', 'is', 'a', 'line']
This

In [82]:
def ex_year(str_cell):
    year=str_cell.split('-')[0]
    return int(year)

In [83]:
ex_year(df['StudentCode'][3])

2016

In [84]:
df['Year']=list(map(ex_year, df['StudentCode']))


#####   MAP only for SERIES #####

In [85]:
df.head()

      Language  Science  History  Maths   StudentCode  Year
Nick        70       60       85     80  2018-9875-13  2018
John        90       80       87     87  2017-9356-23  2017
Jim        100       75       55     88  2019-8988-43  2019
Sam         50       96       67     74  2016-0099-13  2016

In [86]:
df_2=df.drop(columns=['StudentCode','Year'])
df_2.head()

      Language  Science  History  Maths
Nick        70       60       85     80
John        90       80       87     87
Jim        100       75       55     88
Sam         50       96       67     74

In [87]:
len(df_2.iloc[0])

4

In [88]:
df_2.iloc[1].sum()

344

In [89]:
def custom_avg(row):
    avg=row.sum()/len(row)
    return avg

In [90]:
df_2['Average']=df_2.apply(custom_avg, axis=1)

df_2.head()

      Language  Science  History  Maths  Average
Nick        70       60       85     80    73.75
John        90       80       87     87    86.00
Jim        100       75       55     88    79.50
Sam         50       96       67     74    71.75

In [91]:
df['GraduationYear']=df.apply(lambda x: x['Year']+3 ,axis=1)

In [92]:
df.head()

      Language  Science  History  Maths   StudentCode  Year  GraduationYear
Nick        70       60       85     80  2018-9875-13  2018            2021
John        90       80       87     87  2017-9356-23  2017            2020
Jim        100       75       55     88  2019-8988-43  2019            2022
Sam         50       96       67     74  2016-0099-13  2016            2019

In [93]:
df["GraduatingThisYear"]=df.apply(lambda x:'True' if x["GraduationYear"]==2022 else 'False' ,axis=1)
df.head()

,Language,Science,History,Maths,StudentCode,Year,GraduationYear,GraduatingThisYear
Nick,70,60,85,80,2018-9875-13,2018,2021,False
John,90,80,87,87,2017-9356-23,2017,2020,False
Jim,100,75,55,88,2019-8988-43,2019,2022,True
Sam,50,96,67,74,2016-0099-13,2016,2019,False

In [94]:
df[['Language','Science']].loc['Nick']

Language    70
Science     60
Name: Nick, dtype: int64

In [95]:
df['Language']['Nick']

70